# 自然言語処理１００本ノック
4/2/2021 
第2章: UNIXコマンド 

目次

* 10. 行数のカウント
* 11. タブをスペースに置換
* 12. 1列目をcol1.txtに，2列目をcol2.txtに保存
* 13. col1.txtとcol2.txtをマージ
* 14. 先頭からN行を出力
* 15. 末尾のN行を出力
* 16. ファイルをN分割する
* 17. １列目の文字列の異なり
* 18. 各行を3コラム目の数値の降順にソート
* 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる

10. 行数のカウント
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [7]:
ls

popular-names.txt  第一章.ipynb  第二章.ipynb

In [12]:
import pandas as pd
df = pd.read_table('popular-names.txt',header=None, sep='	')
len(df)

2780

11. タブをスペースに置換
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [25]:
import pandas as pd
df = pd.read_table('popular-names.txt',header=None, sep='	')
df.to_csv('popular-names_space.txt',sep=' ',header=False,index=False)

In [40]:
df

              0  1      2     3
0          Mary  F   7065  1880
1          Anna  F   2604  1880
2          Emma  F   2003  1880
3     Elizabeth  F   1939  1880
4        Minnie  F   1746  1880
...         ... ..    ...   ...
2775   Benjamin  M  13381  2018
2776     Elijah  M  12886  2018
2777      Lucas  M  12585  2018
2778      Mason  M  12435  2018
2779      Logan  M  12352  2018

[2780 rows x 4 columns]

12. 1列目をcol1.txtに，2列目をcol2.txtに保存
各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [34]:
df[0].to_csv('col1.txt',sep=' ',header=False,index=False)
df[1].to_csv('col2.txt',sep=' ',header=False,index=False)

In [33]:
ls

col1.txt  popular-names_space.txt  第一章.ipynb
col2.txt  popular-names.txt        第二章.ipynb

13. col1.txtとcol2.txtをマージ
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [35]:
ls

col1.txt  popular-names_space.txt  第一章.ipynb
col2.txt  popular-names.txt        第二章.ipynb

In [47]:
df1 = pd.read_table('col1.txt',header=None)
df2 = pd.read_table('col2.txt',header=None)
df_merge1 = pd.concat([df1, df2], axis=1)
df_merge1.to_csv('col1_col2.txt',sep='	',header=None,index=False)

In [44]:
df_merge1

              0  0
0          Mary  F
1          Anna  F
2          Emma  F
3     Elizabeth  F
4        Minnie  F
...         ... ..
2775   Benjamin  M
2776     Elijah  M
2777      Lucas  M
2778      Mason  M
2779      Logan  M

[2780 rows x 2 columns]

14. 先頭からN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [50]:
N = 10
print(df.head(N))

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
5   Margaret  F  1578  1880
6        Ida  F  1472  1880
7      Alice  F  1414  1880
8     Bertha  F  1320  1880
9      Sarah  F  1288  1880


15. 末尾のN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [51]:
N = 10 
print(df.tail(N))

             0  1      2     3
2770      Liam  M  19837  2018
2771      Noah  M  18267  2018
2772   William  M  14516  2018
2773     James  M  13525  2018
2774    Oliver  M  13389  2018
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

16. ファイルをN分割する
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [63]:
N = 3
step = (len(df) // 3)
for n in range(N):
    df_split = df.iloc[n*step:(n+1)*step]
    df_split.to_csv('popular-names'+str(n)+'.txt', sep=' ',header=False, index=False)

In [64]:
ls

col1_col2.txt  popular-names0.txt  popular-names_space.txt  第二章.ipynb
col1.txt       popular-names1.txt  popular-names.txt
col2.txt       popular-names2.txt  第一章.ipynb


17. １列目の文字列の異なり
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [69]:
name = df[0].unique()
name.sort()
print(name)

['Abigail' 'Aiden' 'Alexander' 'Alexis' 'Alice' 'Amanda' 'Amelia' 'Amy'
 'Andrew' 'Angela' 'Anna' 'Annie' 'Anthony' 'Ashley' 'Austin' 'Ava'
 'Barbara' 'Benjamin' 'Bertha' 'Bessie' 'Betty' 'Brandon' 'Brian'
 'Brittany' 'Carol' 'Carolyn' 'Charles' 'Charlotte' 'Chloe' 'Christopher'
 'Clara' 'Crystal' 'Cynthia' 'Daniel' 'David' 'Deborah' 'Debra' 'Donald'
 'Donna' 'Doris' 'Dorothy' 'Edward' 'Elijah' 'Elizabeth' 'Emily' 'Emma'
 'Ethan' 'Ethel' 'Evelyn' 'Florence' 'Frances' 'Frank' 'Gary' 'George'
 'Hannah' 'Harper' 'Harry' 'Heather' 'Helen' 'Henry' 'Ida' 'Isabella'
 'Jacob' 'James' 'Jason' 'Jayden' 'Jeffrey' 'Jennifer' 'Jessica' 'Joan'
 'John' 'Joseph' 'Joshua' 'Judith' 'Julie' 'Justin' 'Karen' 'Kathleen'
 'Kelly' 'Kimberly' 'Larry' 'Laura' 'Lauren' 'Liam' 'Lillian' 'Linda'
 'Lisa' 'Logan' 'Lori' 'Lucas' 'Madison' 'Margaret' 'Marie' 'Mark' 'Mary'
 'Mason' 'Matthew' 'Megan' 'Melissa' 'Mia' 'Michael' 'Michelle' 'Mildred'
 'Minnie' 'Nancy' 'Nicholas' 'Nicole' 'Noah' 'Oliver' 'Olivia' 'Pamela'
 'Patricia' 'Rachel' 'Rebecca' 'Richard' 'Robert' 'Ronald' 'Ruth'
 'Samantha' 'Sandra' 'Sarah' 'Scott' 'Sharon' 'Shirley' 'Sophia'
 'Stephanie' 'Steven' 'Susan' 'Tammy' 'Taylor' 'Thomas' 'Tracy' 'Tyler'
 'Virginia' 'Walter' 'William']

18. 各行を3コラム目の数値の降順にソート
各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [75]:
num = df.sort_values(by=2,ascending=False)
print (num)

            0  1      2     3
1340    Linda  F  99689  1947
1360    Linda  F  96211  1948
1350    James  M  94757  1947
1550  Michael  M  92704  1957
1351   Robert  M  91640  1947
...       ... ..    ...   ...
27      Annie  F   1326  1881
28     Bertha  F   1324  1881
8      Bertha  F   1320  1880
29      Alice  F   1308  1881
9       Sarah  F   1288  1880

[2780 rows x 4 columns]


19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [80]:
print(df[0].value_counts())

James      118
William    111
John       108
Robert     108
Mary        92
          ...
Rachel       1
Lucas        1
Scott        1
Kelly        1
Crystal      1
Name: 0, Length: 136, dtype: int64